In [30]:
# 讀取numpy函式庫
import numpy as np
# 用np內的random取代python的random
import numpy.random as random

# 讀取scipy函式庫
import scipy as sp
# 用於線性代數的函式庫
import scipy.linalg as linalg
# 用於最佳化計算(最小值)的函式
from scipy.optimize import minimize_scalar

# 讀取pandas函式庫
import pandas as pd
# 處理1維陣列的Series函式庫與處理2維陣列的DataFrame函式庫
from pandas import Series, DataFrame

import matplotlib.pyplot as plt
# 讀取matplotlib函式庫
import matplotlib as mpl
# 讀取seaborn函式庫
import seaborn as sns
%matplotlib inline

# 意指顯示到小數點後第三位
%precision 3

'%.3f'

Series的使用方法

In [31]:
# 1維陣列Series
sample_pandas_data = pd.Series([0,10,20,30,40,50,60,70,80,90])
print(sample_pandas_data)

0     0
1    10
2    20
3    30
4    40
5    50
6    60
7    70
8    80
9    90
dtype: int64

In [32]:
# 將索引(index)設定為英文字母
sample_pandas_index_data = pd.Series(
    [0, 10,20,30,40,50,60,70,80,90],
    index=['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])
print(sample_pandas_index_data)

print('資料的値:', sample_pandas_index_data.values)
print('索引的値:', sample_pandas_index_data.index)

a     0
b    10
c    20
d    30
e    40
f    50
g    60
h    70
i    80
j    90
dtype: int64
資料的値: [ 0 10 20 30 40 50 60 70 80 90]
索引的値: Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'], dtype='object')

DataFrame的使用方法

In [33]:
# 2維陣列DataFrame
attri_data1 = {'ID':['100','101','102','103','104'],
               'City':['Tokyo','Osaka','Kyoto','Hokkaido','Tokyo'],
               'Birth_year':[1990,1989,1992,1997,1982],
               'Name':['Hiroshi','Akiko','Yuki','Satoru','Steve']}

attri_data_frame1 = DataFrame(attri_data1)
print(attri_data_frame1)

    ID      City  Birth_year     Name
0  100     Tokyo        1990  Hiroshi
1  101     Osaka        1989    Akiko
2  102     Kyoto        1992     Yuki
3  103  Hokkaido        1997   Satoru
4  104     Tokyo        1982    Steve

In [34]:
# 將索引(index)設定為英文字母
attri_data_frame_index1 = DataFrame(attri_data1,index=['a','b','c','d','e'])
print(attri_data_frame_index1)

    ID      City  Birth_year     Name
a  100     Tokyo        1990  Hiroshi
b  101     Osaka        1989    Akiko
c  102     Kyoto        1992     Yuki
d  103  Hokkaido        1997   Satoru
e  104     Tokyo        1982    Steve

在Jupyter環境顯示資料

In [35]:
attri_data_frame_index1

    ID      City  Birth_year     Name
a  100     Tokyo        1990  Hiroshi
b  101     Osaka        1989    Akiko
c  102     Kyoto        1992     Yuki
d  103  Hokkaido        1997   Satoru
e  104     Tokyo        1982    Steve

row和column的操作

In [36]:
# 轉置:.T; row和column交換
attri_data_frame1.T

                  0      1      2         3      4
ID              100    101    102       103    104
City          Tokyo  Osaka  Kyoto  Hokkaido  Tokyo
Birth_year     1990   1989   1992      1997   1982
Name        Hiroshi  Akiko   Yuki    Satoru  Steve

In [37]:
# 取出特定column (1個的情況)
attri_data_frame1.Birth_year

0    1990
1    1989
2    1992
3    1997
4    1982
Name: Birth_year, dtype: int64

In [38]:
# 取出特定column (多個的情況)
attri_data_frame1[['ID', 'Birth_year']]

    ID  Birth_year
0  100        1990
1  101        1989
2  102        1992
3  103        1997
4  104        1982

資料的抽出

In [39]:
# 篩選條件boolean比較
attri_data_frame1['City'] == 'Tokyo'

0     True
1    False
2    False
3    False
4     True
Name: City, dtype: bool

In [40]:
# 條件 (過濾器)
attri_data_frame1[attri_data_frame1['City'] == 'Tokyo']

    ID   City  Birth_year     Name
0  100  Tokyo        1990  Hiroshi
4  104  Tokyo        1982    Steve

In [41]:
# 條件 (過濾器、多個值):.isin
attri_data_frame1[attri_data_frame1['City'].isin(['Tokyo','Osaka'])]

    ID   City  Birth_year     Name
0  100  Tokyo        1990  Hiroshi
1  101  Osaka        1989    Akiko
4  104  Tokyo        1982    Steve

資料的刪除與結合

In [42]:
# row或column刪除:.drop; axis=0(row); axis=1(column)
attri_data_frame1.drop(['Birth_year'], axis = 1)

    ID      City     Name
0  100     Tokyo  Hiroshi
1  101     Osaka    Akiko
2  102     Kyoto     Yuki
3  103  Hokkaido   Satoru
4  104     Tokyo    Steve

In [43]:
# 資料準備
attri_data2 = {'ID':['100','101','102','105','107'],
               'Math':[50,43,33,76,98],
               'English':[90,30,20,50,30],
               'Sex':['M','F','F','M','M']}
attri_data_frame2 = DataFrame(attri_data2)
attri_data_frame2

    ID  Math  English Sex
0  100    50       90   M
1  101    43       30   F
2  102    33       20   F
3  105    76       50   M
4  107    98       30   M

In [44]:
# 資料的合併:.merge
pd.merge(attri_data_frame1,attri_data_frame2)

    ID   City  Birth_year     Name  Math  English Sex
0  100  Tokyo        1990  Hiroshi    50       90   M
1  101  Osaka        1989    Akiko    43       30   F
2  102  Kyoto        1992     Yuki    33       20   F

統計

In [45]:
# 資料的群組別統計:.groupby
print(attri_data_frame2.groupby('Sex')['Math'].mean())
print(attri_data_frame2.groupby('Sex')['Math'].max())
print(attri_data_frame2.groupby('Sex')['Math'].min())

Sex
F    38.000000
M    74.666667
Name: Math, dtype: float64
Sex
F    43
M    98
Name: Math, dtype: int64
Sex
F    33
M    50
Name: Math, dtype: int64

值得排序

In [46]:
# 資料準備
attri_data2 = {'ID':['100','101','102','103','104'],
               'City':['Tokyo','Osaka','Kyoto','Hokkaido','Tokyo'],
               'Birth_year':[1990,1989,1992,1997,1982],
               'Name':['Hiroshi','Akiko','Yuki','Satoru','Steve']}
attri_data_frame2 = DataFrame(attri_data2)
attri_data_frame_index2 = DataFrame(attri_data2,index=['e','b','a','d','c'])
attri_data_frame_index2

    ID      City  Birth_year     Name
e  100     Tokyo        1990  Hiroshi
b  101     Osaka        1989    Akiko
a  102     Kyoto        1992     Yuki
d  103  Hokkaido        1997   Satoru
c  104     Tokyo        1982    Steve

In [47]:
# 基於index的排序:.sort_index
attri_data_frame_index2.sort_index()

    ID      City  Birth_year     Name
a  102     Kyoto        1992     Yuki
b  101     Osaka        1989    Akiko
c  104     Tokyo        1982    Steve
d  103  Hokkaido        1997   Satoru
e  100     Tokyo        1990  Hiroshi

In [48]:
# 基於值的排序，預設為從小到大:.sort_values
attri_data_frame_index2.Birth_year.sort_values()

c    1982
b    1989
e    1990
a    1992
d    1997
Name: Birth_year, dtype: int64

nan(null)的判斷

In [49]:
# 確認是否存在該值:.isin
attri_data_frame_index2.isin(['Tokyo'])

      ID   City  Birth_year   Name
e  False   True       False  False
b  False  False       False  False
a  False  False       False  False
d  False  False       False  False
c  False   True       False  False

In [50]:
# nan與null的例子
# 處理遺漏值; 將Name全部設為nan
attri_data_frame_index2['Name'] = np.nan
attri_data_frame_index2

    ID      City  Birth_year  Name
e  100     Tokyo        1990   NaN
b  101     Osaka        1989   NaN
a  102     Kyoto        1992   NaN
d  103  Hokkaido        1997   NaN
c  104     Tokyo        1982   NaN

In [51]:
# 判斷是否為nan:.isnull
attri_data_frame_index2.isnull()

      ID   City  Birth_year  Name
e  False  False       False  True
b  False  False       False  True
a  False  False       False  True
d  False  False       False  True
c  False  False       False  True

In [52]:
# 統計判斷null
attri_data_frame_index2.isnull().sum()

ID            0
City          0
Birth_year    0
Name          5
dtype: int64

問題一
對於下面的資料，請找出Money為500以上的人，並顯示紀錄

In [53]:
from pandas import Series, DataFrame
import pandas as pd

attri_data1 = {'ID':['1','2','3','4','5'],
               'Sex':['F','F','M','M','F'],
               'Money':[1000,2000,500,300,700],
               'Name':['Saito','Horie','Kondo','Kawada','Matsubara']}
attri_data_frame1 = DataFrame(attri_data1)
attri_data_frame1

  ID Sex  Money       Name
0  1   F   1000      Saito
1  2   F   2000      Horie
2  3   M    500      Kondo
3  4   M    300     Kawada
4  5   F    700  Matsubara

In [54]:
attri_data_frame1[attri_data_frame1['Money'] >= 500]
# attri_data_frame1[attri_data_frame1.Money>=500]

  ID Sex  Money       Name
0  1   F   1000      Saito
1  2   F   2000      Horie
2  3   M    500      Kondo
4  5   F    700  Matsubara

問題二
計算問題一資料的男女(MF分開看)的平均Money

In [55]:
attri_data_frame1.groupby('Sex')['Money'].mean()

Sex
F    1233.333333
M     400.000000
Name: Money, dtype: float64

問題三
將下面的資料以相同ID的人為鍵，合併資料。並計算Money、Math和Englist的平均

In [56]:
attri_data2 = {'ID':['3','4','7'],
               'Math':[60,30,40],
               'English':[80,20,30]}
attri_data_frame2 = DataFrame(attri_data2)
attri_data_frame2

  ID  Math  English
0  3    60       80
1  4    30       20
2  7    40       30

In [57]:
# pd.merge(attri_data_frame1,attri_data_frame2)
merge_data = attri_data_frame1.merge(attri_data_frame2)
merge_data.mean()

ID          17.0
Money      400.0
Math        45.0
English     50.0
dtype: float64